---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsReferenceOverallsize
source: html/e6605a31-971a-cc32-6c6e-099f5843c5d9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsReferenceOverallsize Property

"Overall Size"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsReferenceOverallsize { get; }
```